Configuration/1D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sedFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1800;

deltaT          1e-2;

writeControl    adjustableRunTime;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

timeFormat      general;

timePrecision   8;

runTimeModifiable on;

adjustTimeStep  off;

maxCo           0.3;

maxAlphaCo      0.3;

maxDeltaT       2e-1;

functions 
{
	Multiply
	{
	type            multiply;
	libs            (fieldFunctionObjects);
	fields          (alpha.a U.a);
	result          alphaUa;
	executeControl  timeStep;
	writeControl    writeTime;
	}
	fieldAverage
    	{
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        restartOnrestart false;
	periodicRestart     true;
    	restartPeriod       20;
        fields
	(
	    U.a
            {
               mean         on;
               prime2Mean   off;
               base         time;
            }
	    alpha.a
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
	    alphaUa
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
        );
	}
}

// ************************************************************************* //
